app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path
    else
      @song = Song.new(artist_id: params[:artist_id])
      @artist = Artist.find_by(id: params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
---
  def edit
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path
      else
        @song = @artist.songs.find_by(id: params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 6], ["updated_at", "2018-02-20 17:29:03.627520"], ["id", 26]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)